{"pages":[{"title":"<i class='fab fa-d3 d3fa-color-blue'><\/i> Bonuspunkte","text":"Kauf und weitere Informationen zum Modul Bonuspunkte finden Sie in unserem Shop: https:\/\/www.oxidmodule.com\/OXID-eShop\/Module\/Bonuspunkte-fuer-Oxid-PE.html","tags":"","url":"index.html"},{"title":"Changelog","text":"Version 5.0.2.3 - 2020- Fixed unvollständige Updateprozedur auf Version 6 des Shops Version 5.0.2.2 - 2020-07-24 Fixed Controller wurden verschlüsselt ausgeliefert Fehler bei der Ermittlung der Sprache für die Erinnerungs-E-Mails Version 5.0.2.1 Templates für das Theme Wave angepasst, Version 1.0.1 Version 5.0.2.0 Punkte für Bewertungen konnten nicht vergeben werden kleine Refactoring Arbeiten Ausgabe des CronJobs kann als Email versendet werden Version 5.0.1.0 Kleine Layoutänderung im Kundenkonto(nur Flow Theme). Die Angaben zu den Gutscheinen werden jetzt übersichtlicher dargestellt Die .sh-Datei für den CronJob kann nun im Admin des Moduls erstellt werden. Version 5.0.0.2 Kleine Nachbesserung der Dokumentation Version 5.0.0.1 Umstellung der Dokumentation von PDF auf eine HTML-bsierende Dokumentation. Die Dokumentation liegt dem Modul jetzt im Ordner docs\/Documentation\/ bei. Version 5.0.0.0 Angepasst für Shopversion 6.x, Installation via Composer Version 4.1.1.1 Bug beim Einlösen der Bonuspunkte - fehlerhaft benannte Methode wurde korrigiert Bug in der Verwendung der Templates für das Kundenkonto - die Azure Templates wurden nicht verwendet kleine Layoutanpassung bei der Ausgabe der Gutscheine - der Kommentar wurde verschoben angezeigt Version 4.1.1.0 Ausgaben der Kontoübersicht in Templates ausgelagert Bug bei Versand der Reminderemails, Mails wurde häufiger versendet Prüfung und Abbruch wenn automatisch kein Gutschein erstellt wurde Version 4.1.0.1 Umstieg auf den neuen Theme-Mapper des Modul-Connectors, so kann auch das Modul auch mit dem Roxive-Theme eingesetzt werden kleine Bugs bei bei den übersetzungen, in den Templates und CSS-Formatierungen fehlerhafte Datenbankabfragen wenn zwischen der Bestellung und Vergabe der Punkte einige Tage liegen einige zusätzliche Templateblöcke Version 4.1.0.0 Test\/Anpassung auf die 4.10.x\/5.3.x Kundenkonto auf Flow-Theme angepasst neuer Menüpunkt Logmeldungen im Modul Bugfix: Logout im Admin, im Zusammenhang mit dem aktuellen Modul-Connector und dem neuen Admin-Theme Version 4.0.2.3 Bug: fehlerhaftes Include eines Templates im Kundenkonto Test auf 4.9 \/ 5.2 Version 4.0.2.2 Bug: Gutschein wird mit 0 Euro berechnet Bug: Optionen für die Zusendung der E-Mails werden nicht mehr richtig gespeichert Bug: Installationsssistenten wird mehrfach gestartet Version 4.0.2.1 Anpassung Precheck Version 4.0.2.0 Bug bei der Prüfung auf verbotene Kundengruppe Bug bei änderung der E-Mailadressen der Kunden Erhalt der E-Mails kann jetzt auch im Admin am Kunde geändert werden Anzeige der Bezahlarten in den Einstellungen des Modul geändert kleine Templatefehler im Admin behoben Test auf 4.8 Version 4.0.1.0 Bugfix: individuelle Gutscheinlänge wurde nicht beachtet auch für Shopversionen ab 4.8 einsetzbar Systemcheck integriert (d3precheck.php) Version 4.0.0.0 Anpassung auf Oxid 4.7 \/ 5.0 Integration in die D³-Lizenzverwaltung halbautomatische Installation Version 3.0.0.2 stornierte Bestellungen bei der Vergabe von Punkte ignorieren manuell vergebene Punkte in Reminder-Mails beachten Version 3.0.1 Problem wenn die Berechnung der Punkte einen Wert unter 1 ergibt Test auf vorhandene Gutscheinnummern Feld OXVOUCHERID aus Install.sql entfernt Bug bei verbotenen Benutzergruppe Bug bei der Vergabe von Bonuspunkten für Bewertungen an Artikeln Änderungen für Shopversion ab 4.6.0 integriert Version 3.0 Anpassung für OXID 4.5.x Konfiguration im Admin zusätzliche Kriterien Bonuspunkte löschen\/stornieren Erinnerungsemail erweitertes Logging Version 2.2 Punktevergabe für Kundenbewertungen eingebaut Erweiterung der d3points-Tabelle um oxtype- und oxtext-Datenfeld manuelle Punkte können nun über ein Langtextfeld im Admin kommentiert werden logging auf mod_cfg umgestellt securitykey für cronjob eingebaut Version 2.1 Berechnungsfehler im cronjob bereinigt CMS-Bausteine für Automail (Gutscheine) eingefügt Version 2.0 Umstellung des Moduls auf PE4 Version 1.0 Startversion für OXID PE3","tags":"","url":"changelog\/Changelog.html"},{"title":"Installation \/ Update \/ Deinstallation","text":"Anforderungen Neuinstallation Update Deinstallation Bei Bedarf bieten wir Ihnen auch gern die Installation des Moduls in Ihrem Shop an. Geben Sie uns bitte unter den unter Hilfe und Support genannten Kontaktdaten Bescheid.","tags":"","url":"installation\/index.html"},{"title":"Systemanforderungen","text":"PHP Version 5.6.x bis PHP 7.0.x PHP Decoder installierter ionCube Loader *Shopversionen \/ -editionen OXID eShop Professional Edition in Version 6.0.x oder OXID eShop Enterprise Edition in Version 6.0.x D3 Modul-Connector (kostenfrei bei D3 erhältlich) ab Version 5.1.0.0 Installation via Composer mindestens ein freier Cronjob zur automatischen Ausführung der angelegten Aufgaben Beachten Sie, dass die Ihnen vorliegende Modulversion entsprechend für PHP 5.6 oder PHP 7.0 sowie dem auf Ihrem Server vorhandenen Decoder (ionCube Loader) kompatibel ist. Im Zweifelsfall kontaktieren Sie uns und nennen den für Ihren Shop genutzten Decoder und die PHP-Version. Kontrollieren Sie bitte auch, ob diese Modulversion für die von Ihnen eingesetzte Shopedition (Professional Edition (PE) oder Enterprise Edition (EE)) ausgelegt ist.","tags":"","url":"installation\/Anforderungen\/Systemanforderungen.html"},{"title":"Anforderungsprüfung","text":"Im Ordner docs finden Sie den Ordner Precheck. Mit dessen Inhalt können Sie die Mindestanforderungen auf Ihrem Server direkt prüfen. Kopieren Sie die enthaltenen Dateien und Ordner unverändert in das source-Verzeichnis Ihres installierten OXID-Shops. Rufen Sie nun über Ihren Browser die folgende Adresse auf: http:\/\/www.ihreadresse.de\/d3precheck.php Ihnen werden nun Details und Ergebnisse zur Anforderungsprüfung angezeigt. Löschen Sie diese Scripte mit Hilfe der in der Übersicht enthaltenen Funktion bitte unbedingt nach der Prüfung wieder von Ihrem Server.","tags":"","url":"installation\/Anforderungen\/Anforderungspruefung.html"},{"title":"Vorbereitungen","text":"Modul-Connector Installieren Sie bitte zuerst unseren Modul-Connector in der erforderlichen Version. Ob dies evtl. schon geschehen ist, können Sie im Adminbereich Ihres Shops prüfen. Existiert der Punkt D3 Module -&gt; Modul-Connector, können Sie die installierte Version unter Bibliotheksverwaltung ablesen. Fehlt dieser Eintrag, installieren Sie den kostenfreien Connector. Informationen zu dessen Installation finden Sie auf unserer Homepage. Klicken Sie auf den Reiter Downloads und wählen dort das für Ihre Installation passende Paket. alte Modul-Dateien entfernen PHP-Dateien, Templates und Moduleinträge aus einer älteren Modul-Version als 5.0.0.0 müssen entfernt werden. Bestehende Einträge in der Datenbank bleiben weiterhin bestehen und müssen nicht entfernt werden.","tags":"","url":"installation\/Anforderungen\/Vorbereitungen.html"},{"title":"Neuinstallation","text":"Schnellstart per Composer php composer require d3\/points --update-no-dev Detailliertere Angaben zur Installation entnehmen Sie bitte den folgenden Schritten.","tags":"","url":"installation\/Neuinstallation\/index.html"},{"title":"Vorbereitungen","text":"Installieren Sie bitte zuerst unseren Modul-Connector in der erforderlichen Version. Ob dies evtl. schon geschehen ist, können Sie im Adminbereich Ihres Shops prüfen. Existiert der Punkt D3 Module -&gt; Modul-Connector, können Sie die installierte Version unter Bibliotheksverwaltung ablesen. Fehlt dieser Eintrag, laden Sie den Connector kostenfrei von unserer Homepage. Klicken Sie auf den Reiter Download und dort auf den Link Download Erstinstallation Modul-Connector.","tags":"","url":"installation\/Neuinstallation\/Vorbereitung.html"},{"title":"Modul zur Installation hinzufügen","text":"Führen Sie in der Konsole im selben Verzeichnis diesen Befehl aus, um das Modul Bonuspunkte zur Installation hinzuzufügen: php composer require d3\/points --update-no-dev","tags":"","url":"installation\/Neuinstallation\/Modul_hinzufuegen.html"},{"title":"Verwendung eigener Themes","text":"Das Modul ist für die Verwendung mit den folgenden OXID-Themes vorbereitet: Flow Azure Verwenden Sie in Ihrem Shop ein angepasstes Verzeichnis für Ihre Templates (neues Theme oder CustomTheme), kopieren Sie die Templates und \/ oder die CSS-Dateien in die neuen Ordner. Ähnelt Ihr neues Theme technisch einem der OXID-Originale, können Sie dieses darauf umleiten. Childs von originalen OXID- Themes benötigen keine Umleitung. Weitere Informationen zur Umleitung finden Sie in unserer FAQ.","tags":"","url":"installation\/Neuinstallation\/Verwendung_eigener_Themes.html"},{"title":"Providerspezifische Installation","text":"Manche Provider erfordern besondere Einstellungen für installierte Module. Ob Ihr Anbieter spezielle Anforderungen stellt und wie diese aussehen, kontrollieren Sie bitte in unserer FAQ.","tags":"","url":"installation\/Neuinstallation\/Providerspezifische_Installation.html"},{"title":"Modul im Shop aktivieren","text":"Aktivieren Sie das Modul über den Shopadmin Erweiterungen -&gt; Module. Klicken Sie nach Auswahl von Bonuspunkte auf den Button Aktivieren. Enterprise Editon: Achten Sie darauf, dass das Modul in weiteren Shops (Mall) ebenfalls aktiviert werden muss, um dessen Funktion dort auch zu nutzen.","tags":"","url":"installation\/Neuinstallation\/Modul_im_Shop_aktivieren.html"},{"title":"Shopanpassungen installieren","text":"Direkt nach der Modulaktivierung startet der Assistent, der Sie durch die Shopanpassung führt. Darin können Sie verschiedene Optionen der Installation wählen. Den Installationsassistenten finden Sie auch unter den Menüpunkten Admin -&gt; D3 Module -&gt; Modul-Connector -&gt; Modulverwaltung -&gt; Modulinstallation. Bei tiefgreifenden Änderungen an Ihrem Shop (z.B. Hinzufügen weiterer Sprachen oder Mandanten) rufen Sie den Installationsassistenten bitte erneut auf, um dann eventuell notwendige Nacharbeiten für das Modul ausführen zu lassen. Möchten Sie die Änderungen manuell installieren, können Sie sich über diesen Assistenten ebenfalls eine Checkliste erstellen.","tags":"","url":"installation\/Neuinstallation\/Shopanpassungen_installieren.html"},{"title":"CMS-Seiten","text":"Mit der Installation des Moduls wurden CMS-Seiten angelegt. CMS-Texte sowie Sprachbausteine werden im Modul nur in der Standardsprache 1 (Deutsch) mitgeliefert. Passen Sie den Inhalt bitte an Ihre Wünsche an. Nachfolgend die Liste mit den Idents (OXLOADID): Idents Idents d3newpointsmail d3reviewpointsplainmail d3newpointsplainmail d3reviewpointssubjectmail d3newpointssubjectmail d3remindpointsmail d3pointsvouchermail d3remindpointsplainmail d3pointsvoucherplainmail d3remindpointssubjectmail d3pointsvouchersubjectmail d3pointsdisablemail d3pointsautovouchersubjectmail d3pointsdisablemailplain d3pointsautovoucherplainmail d3stornopointssubjectmail d3pointsautovouchermail d3stornopointsmail d3reviewpointsmail d3stornopointsplainmail","tags":"","url":"installation\/Neuinstallation\/CMS-Seiten.html"},{"title":"TMP-Ordner leeren","text":"Leeren Sie das Verzeichnis tmp über Admin -&gt; D3 Module -&gt; Modul-Connector -&gt; TMP leeren. Markieren Sie komplett leeren und klicken auf TMP leeren. Sofern die Views nicht automatisch aktualisiert werden, führen Sie dies noch durch. Erfordert Ihre Installation eine andere Vorgehensweise zum Leeren des Caches oder zum Aktualisieren der Datenbank-Viewtabellen, führen Sie diese bitte aus.","tags":"","url":"installation\/Neuinstallation\/TMP-Ordner_leeren.html"},{"title":"Lizenzschlüssel eintragen","text":"Das Modul verwendet Lizenzschlüssel, um die Lizenzverwaltung für Sie und auch für uns einfacher zu gestalten. Hierbei haben Sie je nach Modul die Wahl zwischen einer kostenfreien Testlizenz und einer Lizenz für den Einsatz im Livebetrieb. Rufen Sie zum Anfordern des Lizenzschlüssels die Modulverwaltung im Adminbereich unter D3 Module -&gt; Modul-Connector -&gt; Modulverwaltung auf. Klappen Sie den Eintrag des jeweiligen Moduls aus. Sofern erforderlich, können Sie hier den Lizenzassistenten starten, der schnell und einfach ihr Modul aktiviert.","tags":"","url":"installation\/Neuinstallation\/Lizenz_eintragen.html"},{"title":"Cronjob anpassen \/ automatische Vergabe der Bonuspunkte","text":"Legen Sie den Cronjob für die automatische Bearbeitung der eingerichteten Aufträge an. Den Link für den Cronjob finden Sie im Adminbereich des Moduls. Dort können Sie sich auch entsprechende sh-Dateien für Ihren Provider erstellen lassen. Passen Sie diese entsprechend Ihren Daten an. Sie sollten unbedingt den Aufruf von .sh-Dateien via Browser verhindern, so dass kein Unbefugter die Datei von außen aufrufen kann. Dazu können Sie z.B. die .htaccess-Datei des Shops um folgende Zeilen erweitern: &lt;Files *.sh&gt; Require all denied &lt;\/Files&gt;","tags":"","url":"installation\/Neuinstallation\/CronJobs.html"},{"title":"Konfiguration einstellen","text":"Leeren Sie das Verzeichnis tmp über Admin -&gt; D3 Module -&gt; Modul-Connector -&gt; TMP leeren. Markieren Sie komplett leeren und klicken auf TMP leeren. Sofern die Views nicht automatisch aktualisiert werden, führen Sie dies noch durch. Erfordert Ihre Installation eine andere Vorgehensweise zum Leeren des Caches oder zum Aktualisieren der Datenbank-Viewtabellen, führen Sie diese bitte aus.","tags":"","url":"installation\/Neuinstallation\/Konfiguration_einstellen.html"},{"title":"Updatefaehigkeit","text":"Bei individuellen Änderungen von Moduldateien empfehlen wir, jeweils die Überladungsmöglichkeiten des Shops dafür zu verwenden. So brauchen Sie die originalen Moduldateien nicht verändern und erhalten sich so die Updatefähigkeit des Shops und des Moduls. Beachten Sie, dass Moduldateien bei Updateinstallationen überschrieben werden. Weitere Informationen zu den Überladungsmöglichkeiten verschiedener Dateien finden Sie in unserer FAQ.","tags":"","url":"installation\/Neuinstallation\/Updatefaehigkeit.html"},{"title":"Modul deaktivieren","text":"Deaktivieren Sie das Modul über den Shopadmin Erweiterungen -&gt; Module. Klicken Sie nach Auswahl von Bonuspunkte auf den Button Deaktivieren.","tags":"","url":"installation\/Update\/Modul_deaktivieren.html"},{"title":"Paketquelle entfernen","text":"Durch einen Wechsel der Paketquelle ist die veraltete Angabe nicht mehr erforderlich. Um Konflikte zu vermeiden, sollte die alte Paketquelle entfernt werden. Haben Sie diese schon früher entfernt, können Sie diesen Schritt überspringen. Starten Sie die Konsole Ihres Webservers und wechseln in das Hauptverzeichnis Ihres Shops (oberhalb des source- und vendor-Verzeichnisses). Senden Sie dort diesen Befehl ab: php composer config --unset repositories.d3 php composer config --unset repositories.D3modules Achten Sie darauf, dass die Installation über Composer mit derselben PHP-Version erfolgt, in der auch Ihr Shop installiert ist. Sie erhalten sonst unpassende Modulpakete. Benötigt Ihre Installation einen anderen Aufruf von Composer, ändern Sie den Befehl bitte entsprechend ab. Für weitere Optionen dieses Befehls lesen Sie bitte die Dokumentation von Composer.","tags":"","url":"installation\/Update\/Paketquelle_entfernen.html"},{"title":"Dateien erneuern","text":"Starten Sie die Konsole Ihres Webservers und wechseln in das Hauptverzeichnis Ihres Shops (oberhalb des source- und vendor-Verzeichnisses). Führen Sie Sie dort nacheinander folgende Befehle aus: php composer update d3\/points --no-dev php composer composer clear-cache Achten Sie darauf, dass die Installation über Composer mit derselben PHP-Version erfolgt, in der auch Ihr Shop installiert ist. Sie erhalten sonst unpassende Modulpakete. Benötigt Ihre Installation einen anderen Aufruf von Composer, ändern Sie den Befehl bitte entsprechend ab. Für weitere Optionen dieses Befehls lesen Sie bitte die Dokumentation von Composer.","tags":"","url":"installation\/Update\/Dateien_erneuern.html"},{"title":"CMS-Texte anpassen","text":"Änderungen an den CMS-Texten durchführen Dem Modul liegen CMS-Texte bei. Diese finden Sie im Verzeichnis \/docs\/CMS. Gleichen Sie die vorhandenen CMS-Texte in Ihrem Shop mit den beigelegten CMS-Texten ab. Der Dateiname entspricht dabei dem Ident (OXLOADID).","tags":"","url":"installation\/Update\/CMS-Seiten.html"},{"title":"Cronjob anpassen \/ automatische Vergabe der Bonuspunkte","text":"Legen Sie den Cronjob für die automatische Bearbeitung der eingerichteten Aufträge an. Den Link für den Cronjob finden Sie im Adminbereich des Moduls. Dort können Sie sich auch entsprechende sh-Dateien für Ihren Provider erstellen lassen. Passen Sie diese entsprechend Ihren Daten an. Sie sollten unbedingt den Aufruf von .sh-Dateien via Browser verhindern, so dass kein Unbefugter die Datei von außen aufrufen kann. Dazu können Sie z.B. die .htaccess-Datei des Shops um folgende Zeilen erweitern: &lt;Files *.sh&gt; Require all denied &lt;\/Files&gt;","tags":"","url":"installation\/Update\/CronJobs.html"},{"title":"Providerspezifische Installation","text":"Manche Provider erfordern besondere Einstellungen für installierte Module. Ob Ihr Anbieter spezielle Anforderungen stellt und wie diese aussehen, kontrollieren Sie bitte unter http:\/\/faq.oxidmodule.com\/Modulinstallation\/providerspezifische-Installation\/.","tags":"","url":"installation\/Update\/Providerspezifische_Installation.html"},{"title":"Modulinformationen aktualisieren","text":"Wechseln Sie im Adminbereich zu Erweiterungen -&gt; Module. Klicken Sie nach Auswahl von Bonuspunkte auf den Button Aktivieren.","tags":"","url":"installation\/Update\/Modulinformationen_aktualisieren.html"},{"title":"Shopanpassungen installierren","text":"Ob Shopanpassungen notwendig sind, ist von der Versionsänderung des Moduls abhängig. Möglicherweise sehen Sie nach dem Neuaktivieren des Moduls den Installationsassistent, der Sie durch die Änderungen führt. Folgen Sie dann den einzelnen Schritten. Möchten Sie die Änderungen manuell installieren, können Sie sich über diesen Assistenten ebenfalls eine Checkliste erstellen. Wird der Assistent nicht gezeigt (Sie sehen wieder die Modulübersicht), waren keine Anpassungen am Shop notwendig. Ob erforderliche Updates ausgeführt werden sollen, können Sie jederzeit im Adminbereich unter D3 Module -&gt; Modul-Connector -&gt; Modulverwaltung -&gt; Modulinstallation prüfen.","tags":"","url":"installation\/Update\/Shopanpassungen_installieren.html"},{"title":"TMP-Ordner leeren","text":"Leeren Sie das Verzeichnis tmp über Admin -&gt; D3 Module -&gt; Modul-Connector -&gt; TMP leeren. Markieren Sie komplett leeren und klicken auf TMP leeren. Sofern die Views nicht automatisch aktualisiert werden, führen Sie dies noch durch. Erfordert Ihre Installation eine andere Vorgehensweise zum Leeren des Caches oder zum Aktualisieren der Datenbank-Viewtabellen, führen Sie diese bitte aus.","tags":"","url":"installation\/Update\/TMP-Ordner_leeren.html"},{"title":"Konfiguration einstellen","text":"Die Einstellungen für das Modul werden ab Version 3.0 im Admin unter D3 Module -&gt; Bonuspunkte -&gt; Konfiguration vorgenommen. Die Einstellung bei älteren Modulen befand sich bisher in der Datei config_inc.php. Modul-Einstellung müssen somit übertragen werden und können anschließend aus der Datei config_inc.php entfernt werden. Die Grund-Konfiguration des Moduls ab Version 3.0 ist schon in der Datenbank abgelegt und wird von der neuen Version erkannt","tags":"","url":"installation\/Update\/Konfiguration_einstellen.html"},{"title":"Installationsprüfung","text":"Um die erfolgreiche Installation zu prüfen, können Sie die folgende(n) Checkliste(n) verwenden: Einstellungsunabhängige Prüfungen Backend Modul ist unter Erweiterungen -&gt; Module aktiv geschaltet Modul ist unter D3 Module -&gt; Modul-Connector -&gt; Modulverwaltung aktiv geschaltet Modul zeigt unter D3 Module -&gt; Bonuspunkte einen eigenen Bereich für Einstellungen Modul zeigt unter Benutzer verwalten -&gt; Benutzer einen eigenen Tab für Einstellungen: Frontend Einbindung im Flyout-Menü im Header: Modul zeigt einen Menüpunkt Meine Bonuspunkte unter Konto","tags":"","url":"installation\/Installationspruefung.html"},{"title":"Schnellstart","text":"Bestellungen auf Startpunkt setzten Das Modul vergibt Punkte an Bestellungen die einen bestimmten Marker in der Datenbank noch nicht besitzen. Zum Start dieses Moduls besitzt keine der Bestellungen diesen Marker, damit sind alle Bestellungen die vor der Installation des Moduls liegen für die Vergabe der Punkte frei gegeben. Dürfen nur Bestellungen ab dem Installationsdatum vom Modul bearbeitet werden ist dieser Marker zu setzten. Dies kann im Admin des Moduls getan werden: D3 Module -&gt; Bonuspunkte -&gt; Konfiguration -&gt; Tab Wartung -&gt; Alle Bestellungen zurücksetzen Markieren Sie sämtliche Bestellungen als bearbeitet und erst nachfolgende Bestellungen werden vom Modul beachtet.","tags":"","url":"installation\/Schnellstart.html"},{"title":"Modulerweiterungen deaktivieren und entfernen","text":"Deaktivieren Sie alle vorhandenen Erweiterungen, die auf dem Modul Bonuspunkte aufbauen und löschen bitte alle Dateien dieser Erweiterungen. Entfernen Sie ebenfalls alle individuellen Templateanpassungen für dieses Modul.","tags":"","url":"installation\/Deinstallation\/Modulerweiterungen_deaktivieren_und_entfernen.html"},{"title":"Modul deaktivieren","text":"Deaktivieren Sie das Modul Bonuspunkte über den Shopadmin Erweiterungen -&gt; Module. Klicken Sie nach Auswahl von Bonuspunkte auf den Button Deaktivieren.","tags":"","url":"installation\/Deinstallation\/Modul_deaktivieren.html"},{"title":"Modul aus der Installation entfernen","text":"Starten Sie die Konsole Ihres Webservers und wechseln in das Hauptverzeichnis Ihres Shops (oberhalb des source- und vendor-Verzeichnisses). Führen Sie Sie dort diesen Befehl aus: php composer remove d3\/points --no-update Achten Sie darauf, dass die Installation über Composer mit derselben PHP-Version erfolgt, in der auch Ihr Shop installiert ist. Sie erhalten sonst unpassende Modulpakete. Benötigt Ihre Installation einen anderen Aufruf von Composer, ändern Sie den Befehl bitte entsprechend ab. Für weitere Optionen dieses Befehls lesen Sie bitte die Dokumentation von Composer.","tags":"","url":"installation\/Deinstallation\/Modul_aus_der_Installation_entfernen.html"},{"title":"Dateien löschen","text":"Löschen Sie den Ordner points und seine enthaltenen Elemente aus dem Verzeichnis source\/modules\/d3 Ihres Shops. Bestätigen Sie anschließend im Shopadmin unter Erweiterungen -&gt; Module -&gt; Installierte Shop-Module die Nachricht: Es gibt registrierte Erweiterungen im eShop, deren Verzeichnis nicht vorhanden ist. Möchten Sie alle Modulinformationen einschließlich Konfigurationseinstellungen und Blockinformationen für Templates löschen?","tags":"","url":"installation\/Deinstallation\/Dateien_loeschen.html"},{"title":"Datenbank bereinigen","text":"Das Modul legt Informationen in der Datenbank ab. Sofern diese Daten nicht mehr benötigt werden, können diese gelöscht werden. Legen Sie sich vorab bitte unbedingt eine Sicherung an, um die Daten im Zweifelsfall wiederherstellen zu können. Für das Modul Bonuspunkte sind dies die folgende Tabellen und Felder: die komplette Tabelle d3points und diese Felder in bestehenden Tabellen: **) in oxorder: das Feld D3ISSETPOINTS in oxuser: die Felder D3POINTSMAILOPTION und D3POINTSSENDREMINDER sowie diese Einträge bestehenden Tabellen: in Tabelle d3_cfg_mod: den Eintrag oxmodid = &quot;d3points&quot; ***) **) Diese Felder sind für alle (Sub)Shops notwendig. Ist die Entfernung in nur einen von mehreren Mandaten gewünscht, so dürfen diese Felder nicht entfernt werden. ***) Diesen Eintrag gibt es ggf. für jeden Subshop. Entfernen Sie diesen nur für die Mandanten, in denen das Modul nicht mehr installiert ist.","tags":"","url":"installation\/Deinstallation\/Datenbank_bereinigen.html"},{"title":"TMP-Ordner leeren","text":"Leeren Sie das Verzeichnis tmp über Admin -&gt; D3 Module -&gt; Modul-Connector -&gt; TMP leeren. Markieren Sie komplett leeren und klicken auf TMP leeren. Sofern die Views nicht automatisch aktualisiert werden, führen Sie dies noch durch. Erfordert Ihre Installation eine andere Vorgehensweise zum Leeren des Caches oder zum Aktualisieren der Datenbank-Viewtabellen, führen Sie diese bitte aus.","tags":"","url":"installation\/Deinstallation\/TMP-Ordner_leeren.html"},{"title":"Modul testen","text":"Das Modul enthält einen Testmodus. Damit können Aktionen mit dem Modul durchgeführt werden ohne das der Kunde die E-Mails erhält. Dazu ist die Aktivierung des Testmodus und die Hinterlegung einer E-Mail notwendig. Eventuelle Änderungen in der Datenbank wie erstellte Bonuspunkte oder vom Modul bearbeitete Bestellungen müssen natürlich in der Datenbank zurückgesetzt werden. TestModus: Admin -&gt; D3 Module -&gt; Bonuspunkte -&gt; Konfiguration -&gt; Tab Konfiguration -&gt; Test-Modus E-Mail Adresse: Admin -&gt; D3 Module -&gt; Bonuspunkte -&gt; Konfiguration -&gt; Tab Konfiguration -&gt; Konfiguration E-Mails -&gt; Test-E-Mailadresse angeben","tags":"","url":"support\/FAQ\/Modul_testen.html"},{"title":"Fehlermeldungen anzeigen","text":"Dem Modul können unterschiedlich viele (Fehler)-Meldungen entlockt werden. Dazu gibt es im Admin des Moduls zwei Schalter: Admin -&gt; D3 Module -&gt; Bonuspunkte -&gt; Konfiguration -&gt; Tab Konfiguration: Logging: Logging komplett ausschalten Nur Fehler mit schreiben Auch Fehler + Statusmeldungen (Alles protokollieren) Debug-Modus Ist &quot;Alles protokollieren&quot; und der Debug-Modus aktiv, dann werden zusätzlich verschiedene Datenbankabfragen protokolliert und in der Tabelle d3log abgelegt. Bei vielen Bestellungen und einem hohen Ausführungsinterval des CronJobs sollte die Größe der Tabelle d3log periodisch überprüft werden und ältere Einträge gelöscht werden.","tags":"","url":"support\/FAQ\/Modul_Funktionen_deaktivieren.html"},{"title":"Modul \/ Funktionen deaktivieren","text":"Das Modul bzw. Funktionen können einzeln deaktiviert werden. Modul aktiv: Damit wird der CronJob und sämtliche Funktionen des Moduls im Shop abgeschaltet -dies betrifft die verschiedenen Links im Shops zur Seite &quot;Meine Bonuspunkte&quot; im Kontobereich. Dies sollte jedoch nur im Notfall verwendet werden - eventuell gibt es Abhängigkeiten und es kommt zu Fehlermeldungen im Shop - darum danach kurz den Shop testen! CronJob - &quot;an\/aus&quot;: kann ohne Probleme abgeschaltet werden. Zu Bewertungen werden aber weiterhin Punkte vergeben. Dies kann aber durch die Herabsetzung der vergebenen Punkte für Bewertungen unterbunden werden. Punktevergabe \/ Automatische Gutscheinvergabe \/ E-Mail mit Bonuspunkte \/ Erinnerungs-E-Mails - &quot;an\/aus&quot;: für diese Funktionen. Ideal um die Funktionen der Reihe nach zu testen. Wird das Modul im Shop komplett deaktivert: Erweiterungen -&gt; Module -&gt; Bonuspunkte: dann sollte der tmp-Ordner geleert werden. Siehe TMP-Ordner leeren","tags":"","url":"support\/FAQ\/Fehlermeldungen_anzeigen.html"},{"title":"Hilfe und Support","text":"Bei Bedarf bieten wir Ihnen auch gern die Installation des Moduls in Ihrem Shop an. Geben Sie uns bitte unter den unten genannten Kontaktdaten Bescheid. Haben Sie Fragen oder Unklarheiten in Verbindung mit diesem Modul oder dessen Installation, stehen Ihnen Hilfetexte in unserer Modul-FAQ zur Verfügung. Finden Sie darin die benötigten Antworten nicht, kontaktieren Sie uns bitte unter den folgenden Möglichkeiten: per E-Mail: support@shopmodule.com oder über das Kontaktformular auf Oxidmodule.com oder per Telefon: (+49) 37 21 \/ 26 80 90 zu unseren Bürozeiten Geben Sie bitte an, wo und wie wir gegebenenfalls vorhandene Schwierigkeiten nachvollziehen können. Sind Ihre Fragen shopspezifisch, benötigen wir möglicherweise Zugangsdaten zum betreffenden Shop. Wir wünschen Ihnen mit Ihrem Shop und dem Modul viel Erfolg! Ihr D³-Team.","tags":"","url":"support\/Hilfe-und-Support.html"}]}